ReneLuedecke/stm32-helium-demo/Projects/NUCLEO-N657X0-Q/Examples/CORTEX/CORTEX_HELIUM/FSBL/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "main.h"
#include "arm_mve.h"
#include "stdio.h"
#include <stdint.h>
#include <string.h>
#include "xspi_nor.h"
#include "stm32n6xx_nucleo_xspi.h"   // Board BSP für XSPI NOR
#include "mx25um51245g.h"           // (Flash-Component, je nach Setup)

/* Private defines -----------------------------------------------------------*/



/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

UART_HandleTypeDef huart1;
XSPI_HandleTypeDef hxspi2;

#define HPIX 640
#define VPIX 480
#define N (HPIX * VPIX)


//__attribute__((aligned(16), section(".axisram1"))) uint16_t src_u16[N];
//__attribute__((aligned(16), section(".axisram1"))) uint16_t gain_u16[N];
//__attribute__((aligned(16), section(".axisram1"))) uint16_t off_u16[N];
//__attribute__((aligned(16), section(".axisram1"))) uint16_t dst_u16[N];
//__attribute__((aligned(16), section(".axisram1"))) uint16_t temp_u16[N];
//__attribute__((aligned(16), section(".axisram1"))) uint16_t planck_table[65536];

__attribute__((aligned(16), section(".axisram1"))) uint16_t src_u16[N];  // 614 KB
__attribute__((aligned(16), section(".axisram1"))) uint16_t planck_table[65536];  // 131 KB

/* Cold data in RAM (2048 KB) */
__attribute__((aligned(16))) uint16_t gain_u16[N];  // 614 KB
__attribute__((aligned(16))) uint16_t dst_u16[N];   // 614 KB
__attribute__((aligned(16))) uint16_t off_u16[N];
__attribute__((aligned(16))) uint16_t temp_u16[N];

#define LED1_SET()    (GPIOG->BSRR = LED1_Pin)
#define LED1_RESET()  (GPIOG->BSRR = (LED1_Pin << 16))
#define LED1_Pin GPIO_PIN_8
#define LED1_GPIO_Port GPIOG
#define BUFFERSIZE_XSPI                  256
#define BUFFERSIZE                  256

/* XSPI Test Buffers */
uint8_t testTxBuffer[BUFFERSIZE_XSPI];   // Zu schreibende Daten
uint8_t testRxBuffer[BUFFERSIZE_XSPI];   // Gelesene Daten



static void process_image_full(void);

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_XSPI2_Init(void);
/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
/* Definitions for UART terminal */
#if !defined(TERMINAL_IO)

UART_HandleTypeDef huart1;
static void MX_USART1_UART_Init(void);

#if defined(__ICCARM__)
__ATTRIBUTES size_t __write(int, const unsigned char *, size_t);
#endif /* __ICCARM__ */

#if defined(__ICCARM__)
/* New definition from EWARM V9, compatible with EWARM8 */
int iar_fputc(int ch);
#define PUTCHAR_PROTOTYPE int iar_fputc(int ch)
#elif defined ( __CC_ARM ) || defined(__ARMCC_VERSION)
/* ARM Compiler 5/6*/
#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#elif defined(__GNUC__)
#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#endif /* __ICCARM__ */
#endif /* TERMINAL_IO */
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */

/* USER CODE BEGIN PFP */
void process_mve(const uint16_t *src, const uint16_t *gain,
                              uint16_t *dst, int n, int16_t offset)
{
  int i = 0;
  const int step = 8;
  const uint8_t shift = 15;  // Q15 format

  // Constants for SIMD
  const uint32x4_t rnd = vdupq_n_u32(1u << (shift - 1));  // Rounding: 0x4000
  const int32x4_t off32 = vdupq_n_s32(offset);
  const int32x4_t zeroS = vdupq_n_s32(0);
  const int32x4_t negSh = vdupq_n_s32(-15);

  // SIMD loop: process 8 pixels at a time
  for (; i <= n - step; i += step)
  {
    uint16x8_t s16 = vld1q_u16(src + i);
    uint16x8_t g16 = vld1q_u16(gain + i);

    // 16x16 -> 32-bit multiply (TRUE 32-bit intermediate!)
    uint32x4_t lo32 = vmullbq_int_u16(s16, g16);  // Lower 4 elements
    uint32x4_t hi32 = vmulltq_int_u16(s16, g16);  // Upper 4 elements

    // Add rounding
    lo32 = vaddq_u32(lo32, rnd);
    hi32 = vaddq_u32(hi32, rnd);

    // Right shift by 15 (Q15 division)
    lo32 = vshlq_u32(lo32, negSh);
    hi32 = vshlq_u32(hi32, negSh);

    // Add offset with saturation
    int32x4_t loS = vqaddq_s32(vreinterpretq_s32_u32(lo32), off32);
    int32x4_t hiS = vqaddq_s32(vreinterpretq_s32_u32(hi32), off32);

    // Clamp to [0, 65535]
    loS = vmaxq_s32(loS, zeroS);
    hiS = vmaxq_s32(hiS, zeroS);

    // Convert back to u32 for narrow
    uint32x4_t loU = vreinterpretq_u32_s32(loS);
    uint32x4_t hiU = vreinterpretq_u32_s32(hiS);

    // Narrow: u32 -> u16 with saturation
    uint16x8_t out = vdupq_n_u16(0);
    out = vqmovnbq_u32(out, loU);  // Bottom 4 lanes
    out = vqmovntq_u32(out, hiU);  // Top 4 lanes

    vst1q_u16(dst + i, out);
  }

  // Scalar tail for remaining pixels
  for (; i < n; ++i) {
    uint32_t prod = (uint32_t)src[i] * (uint32_t)gain[i];
    uint32_t rounded = prod + (1u << (shift - 1));
    uint32_t shifted = rounded >> shift;
    int32_t result = (int32_t)shifted + (int32_t)offset;

