ReneLuedecke/stm32-helium-demo/Projects/NUCLEO-N657X0-Q/Examples/CORTEX/CORTEX_HELIUM/FSBL/Src/main.c
  if (HAL_XSPI_AutoPolling(hxspi, &sConfig, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    Error_Handler();
  }
}

int main(void)
{
	  XSPI_RegularCmdTypeDef sCommand = {0};
	  uint16_t index, errorBuffer = 0;
  // System init
  SCB_EnableICache();
  SCB_EnableDCache();
  HAL_Init();
  MPU->CTRL = 0;
  __DSB();
  __ISB();
  SystemClock_Config();
  MX_GPIO_Init();
  MX_XSPI2_Init();
  MX_USART1_UART_Init();

  /* ============================================ */
  /* XSPI Initialisierung                         */
  /* ============================================ */
  printf("\n\n");
  printf("================================================\n");
  printf("  XSPI NOR Flash Test\n");
  printf("================================================\n\n");

  // 1. Testdaten vorbereiten
  printf("Preparing test data (0x00 to 0xFF)...\n");
  for (int i = 0; i < 256; i++) {
    testTxBuffer[i] = (uint8_t)i;
  }

  XSPI_NOR_Init_All();

      int32_t rc = BSP_XSPI_NOR_EraseBlock(0, 0, BSP_XSPI_NOR_ERASE_64K);
      if (rc != BSP_ERROR_NONE) {
          printf("ERROR: Erase failed (code: %ld)\n", rc);
          return HAL_ERROR;
      }
      return HAL_OK;


 // Test: Erase, Write, Read
 uint8_t testData[256];
 for (int i = 0; i < 256; i++) testData[i] = i;

 XSPI_NOR_EraseSector(0x00000000);
 XSPI_NOR_Write(testData, 0x00000000, 256);

 uint8_t readData[256] = {0};
 XSPI_NOR_Read(readData, 0x00000000, 256);

 // Verify
 int errors = 0;
 for (int i = 0; i < 256; i++) {
	 if (testData[i] != readData[i]) errors++;
 }


  printf("\n");
  printf("================================================\n");
  printf("  STM32N6 14-Bit Sensor\n");
  printf("  Format: Q15 (Gain 0.0 - 2.0)\n");
  printf("================================================\n");
  printf("Resolution: %ux%u = %u pixels\n", HPIX, VPIX, N);
  printf("CPU:        600 MHz\n");
  printf("SIMD:       ARM MVE (Helium)\n");
  printf("Memory:     AXISRAM1\n\n");

  /* ============================================ */
  /* STEP 1: Initialize Planck Lookup Table      */
  /* ============================================ */

  printf("Initializing Planck lookup table...\n");

  // Example: Simple gamma correction (you can replace with real Planck)
  for (uint32_t i = 0; i < 65536; i++) {
    // Linear for now - replace with your Planck formula
    planck_table[i] = (uint16_t)i;

    // Example gamma 2.2:
    // float normalized = (float)i / 65535.0f;
    // float gamma = powf(normalized, 1.0f / 2.2f);
    // planck_table[i] = (uint16_t)(gamma * 65535.0f);
  }

  printf("Planck table ready!\n\n");

  /* ============================================ */
  /* STEP 2: Setup Test Image                    */
  /* ============================================ */

  printf("Generating test pattern...\n");

  // Simulate 14-bit sensor data
  for (uint32_t i = 0; i < N; i++) {
    // Test pattern: gradient
    uint32_t x = i % HPIX;
    uint32_t y = i / HPIX;
    src_u16[i] = (uint16_t)((x * 16383) / HPIX);  // 0 to 16383

    // Per-pixel gain (uniform for now)
    float gain_float = 1.0f;  // Unity gain
    gain_u16[i] = gain_to_q15(gain_float);
  }

  printf("Test pattern ready!\n\n");

  /* ============================================ */
  /* STEP 3: Benchmark                           */
  /* ============================================ */

  printf("================================================\n");
  printf("  BENCHMARK: Full Pipeline\n");
  printf("================================================\n\n");

  printf("Test 1: Unity gain (1.0)\n");
  for (uint32_t i = 0; i < N; i++) {
    gain_u16[i] = gain_to_q15(1.0f);  // 0x8000
  }

  __DSB();
  __ISB();
  DWT->CTRL |= 1;
  uint32_t t0 = DWT->CYCCNT;

  // Step 1: Apply gain + offset
  process_mve(src_u16, gain_u16, temp_u16, N, 0);


  uint32_t t1 = DWT->CYCCNT;

  //planck_lut(temp_u16, dst_u16, N);
  planck_lut_mve(temp_u16, dst_u16, N);

  uint32_t t2 = DWT->CYCCNT;

  uint32_t cyc_gain = (t1 - t0);
  uint32_t cyc_planck = (t2 - t1);
  uint32_t cyc_total = (t2 - t0);

  printf("  Gain/Offset: %u cycles (%u ms)\n",
         (unsigned)cyc_gain, (unsigned)(cyc_gain / 600000));
  printf("  Planck LUT:  %u cycles (%u ms)\n",
         (unsigned)cyc_planck, (unsigned)(cyc_planck / 600000));
  printf("  Total:       %u cycles (%u ms)\n",
         (unsigned)cyc_total, (unsigned)(cyc_total / 600000));
  printf("  FPS:         %u\n\n",
         (unsigned)(600000000 / cyc_total));

  printf("================================================\n");
  printf("  CONTINUOUS PROCESSING\n");
  printf("================================================\n");
  printf("Running at maximum speed (~23 FPS)\n");
  printf("LED toggles every frame\n");
  printf("Format: Q15 (gain 0.0 - 2.0)\n\n");

  // LED Test
  printf("Testing LED...\n");
  for (int i = 0; i < 3; i++) {
    LED1_SET();
    HAL_Delay(200);
    LED1_RESET();
    HAL_Delay(200);
  }
  printf("LED OK!\n\n");

  // Setup for continuous operation
  for (uint32_t i = 0; i < N; i++) {
    src_u16[i] = 8000 + (i % 8000);
    gain_u16[i] = gain_to_q15(1.0f);
  }

  uint32_t frame_count = 0;
  uint8_t led_state = 0;

  while (1)
  {
    // Process frame at maximum speed
    process_mve(src_u16, gain_u16, temp_u16, N, 0);
    planck_lut_mve(temp_u16, dst_u16, N);

    // Toggle LED every 10 frames (~2 Hz, visible)
    //frame_count++;
    //if (frame_count >= 10) {
      if (led_state) {
        LED1_RESET();
        led_state = 0;
      } else {
        LED1_SET();
        led_state = 1;
      }
      //frame_count = 0;
    //}
  }
}
/* USER CODE BEGIN CLK 1 */

/*         The system Clock is configured as follows :
              CPU Clock source               = IC1_CK
              System bus Clock source        = IC2_IC6_IC11_CK
              CPUCLK (sysa_ck) (Hz)          = 600000000
              SYSCLK AXI (sysb_ck) (Hz)      = 400000000
              SYSCLK NPU (sysc_ck) (Hz)      = 300000000
              SYSCLK AXISRAM3/4/5/6 (sysd_ck) (Hz) = 400000000
              HCLKx(Hz)                      = 200000000
              PCLKx(Hz)                      = 200000000
              AHB Prescaler                  = 2
              APB1 Prescaler                 = 1
              APB2 Prescaler                 = 1
              APB4 Prescaler                 = 1
              APB5 Prescaler                 = 1
              PLL1 State                     = ON
              PLL1 clock source              = HSI
              PLL1 M                         = 4
              PLL1 N                         = 75
              PLL1 P1                        = 1
              PLL1 P2                        = 1
              PLL1 FRACN                     = 0
              PLL2 State                     = BYPASS
              PLL2 clock source              = HSI
              PLL3 State                     = BYPASS
              PLL3 clock source              = HSI
              PLL4 State                     = BYPASS
              PLL4 clock source              = HSI
*/
/* USER CODE END CLK 1 */

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the System Power Supply
  */
  if (HAL_PWREx_ConfigSupply(PWR_EXTERNAL_SOURCE_SUPPLY) != HAL_OK)
  {
    Error_Handler();
  }

  /* Enable HSI */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSIDiv = RCC_HSI_DIV1;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL1.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.PLL2.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.PLL3.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.PLL4.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

